app/views/book_comments/_index.html.erb

SELECT "book_comments".* FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 2]]
---
      <div class="comments">
        <% book.book_comments.each do |book_comment| %>