app/views/books/_index.html.erb

SELECT "books".* FROM "books"
---
        <td>
            <p><%= link_to "#{book.book_comments.count} コメント", book_path(book.id) %></p>