app/controllers/book_comments_controller.rb

 def create
   @book = Book.find(params[:book_id])
   @comment = current_user.book_comments.new(book_comment_params)
   @comment.book_id = @book.id
   unless @comment.save
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "book_comments" ("comment", "user_id", "book_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["comment", "ffff"], ["user_id", 4], ["book_id", 1], ["created_at", "2021-03-03 11:35:25.950945"], ["updated_at", "2021-03-03 11:35:25.950945"]]

 def destroy
   @book = Book.find(params[:book_id])
   BookComment.find_by(id: params[:id], book_id: params[:book_id]).destroy
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
DELETE FROM "book_comments" WHERE "book_comments"."id" = ?  [["id", 29]]
SELECT  "book_comments".* FROM "book_comments" WHERE "book_comments"."id" = ? AND "book_comments"."book_id" = ? LIMIT ?  [["id", 29], ["book_id", 5], ["LIMIT", 1]]