app/controllers/books_controller.rb

  def correct_user
        @book = Book.find(params[:id])
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @book = Book.new(book_params)
    @book.user_id = current_user.id
    if @book.save
      redirect_to book_path(@book), notice: "You have created book successfully."
    else
      @books = Book.all
---
INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "ddd"], ["body", "dd"], ["user_id", 4], ["created_at", "2021-03-01 13:23:33.330095"], ["updated_at", "2021-03-01 13:23:33.330095"]]
SELECT "books".* FROM "books"